In [1]:
import pandas as pd

In [3]:
india_weather=pd.DataFrame({
    "city":["mumbai","delhi","banglore"],
    "temperature":[32,45,30],
    "humidity":[80,60,78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [4]:
un_weather =pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[12,32,12],
    "humidity":[32,12,42]
})
un_weather

       city  temperature  humidity
0  new york           12        32
1   chicago           32        12
2   orlando           12        42

In [12]:
df = pd.concat([india_weather,un_weather],keys =["india","un"] )
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
un    0  new york           12        32
      1   chicago           32        12
      2   orlando           12        42

In [13]:
df.loc[un]

NameError: name 'un' is not defined

In [14]:
df.loc['un']

       city  temperature  humidity
0  new york           12        32
1   chicago           32        12
2   orlando           12        42

In [15]:
df.loc['india']

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [19]:
temperature_df = pd.DataFrame({
    "city":["mumbai","delhi","banglore"],
    "temperature":[32,45,30],
    },index = [0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [24]:
windspeed_df = pd.DataFrame({
    "city":["delhi","mumbai"],
    "windspeed":[2,12],
},index= [1,0])
windspeed_df

     city  windspeed
1   delhi          2
0  mumbai         12

In [26]:
pd.concat([temperature_df,windspeed_df],axis = 1)

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        2.0
2  banglore           30     NaN        NaN

In [27]:
df1 =pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[12,32,12],
    
})
df1

       city  temperature
0  new york           12
1   chicago           32
2   orlando           12

In [28]:
df2 =pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "humidity":[32,12,42]
})
df2

       city  humidity
0  new york        32
1   chicago        12
2   orlando        42

In [30]:
df3 = pd.merge(df1,df2,on = "city")
df3

       city  temperature  humidity
0  new york           12        32
1   chicago           32        12
2   orlando           12        42

In [31]:
df1 =pd.DataFrame({
    "city":["new york","chicago","san diago"],
    "humidity":[32,12,42]
})
df1

        city  humidity
0   new york        32
1    chicago        12
2  san diago        42

In [32]:
df2 =pd.DataFrame({
    "city":["new york","chicago","orlado","baltimore"],
    "humidity":[32,12,42,34]
})
df2

        city  humidity
0   new york        32
1    chicago        12
2     orlado        42
3  baltimore        34

In [36]:
pd.merge(df1,df2,on = "city", how = "left")

       city  temperature  humidity
0  new york           12      32.0
1   chicago           32      12.0
2   orlando           12       NaN

In [38]:
pd.merge(df1,df2,on = "city", how = " right")

UnboundLocalError: cannot access local variable 'lidx' where it is not associated with a value